[{"title":"JavaScript: The Good Parts","authors":"Douglas Crockford","description":"Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must.","selfLink":"http://play.google.com/books/reader?id=PXa2bby0oQ0C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=PXa2bby0oQ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Eloquent JavaScript","authors":"Marijn Haverbeke","description":"Diving deep into the JavaScript language to show you how to write beautiful, effective code, this book uses extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. --","selfLink":"http://play.google.com/books/reader?id=p1v6DwAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=p1v6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript Patterns","authors":"Stoyan Stefanov","description":"What's the best approach for developing an application with JavaScript? This book helps you answer that question with numerous JavaScript coding patterns and best practices. If you're an experienced developer looking to solve problems related to objects, functions, inheritance, and other language-specific categories, the abstractions and code templates in this guide are ideal—whether you're using JavaScript to write a client-side, server-side, or desktop application. Written by JavaScript expert Stoyan Stefanov—Senior Yahoo! Technical and architect of YSlow 2.0, the web page performance optimization tool—JavaScript Patterns includes practical advice for implementing each pattern discussed, along with several hands-on examples. You'll also learn about anti-patterns: common programming approaches that cause more problems than they solve. Explore useful habits for writing high-quality JavaScript code, such as avoiding globals, using single var declarations, and more Learn why literal notation patterns are simpler alternatives to constructor functions Discover different ways to define a function in JavaScript Create objects that go beyond the basic patterns of using object literals and constructor functions Learn the options available for code reuse and inheritance in JavaScript Study sample JavaScript approaches to common design patterns such as Singleton, Factory, Decorator, and more Examine patterns that apply specifically to the client-side browser environment","selfLink":"http://play.google.com/books/reader?id=pAmODwAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=pAmODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Mission JavaScript","authors":"Sheela Preuitt","description":"Introduce readers to JavaScript, a programming language that makes websites interactive. It lets us use search boxes, watch online videos, and more! A digital Page Plus feature allows readers to experiment on their own with fun coding activities.","selfLink":"http://play.google.com/books/reader?id=NxaXDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=NxaXDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Speaking JavaScript","authors":"Axel Rauschmayer","description":"Like it or not, JavaScript is everywhere these days—from browser to server to mobile—and now you, too, need to learn the language or dive deeper than you have. This concise book guides you into and through JavaScript, written by a veteran programmer who once found himself in the same position. Speaking JavaScript helps you approach the language with four standalone sections. First, a quick-start guide teaches you just enough of the language to help you be productive right away. More experienced JavaScript programmers will find a complete and easy-to-read reference that covers each language feature in depth. Complete contents include: JavaScript quick start: Familiar with object-oriented programming? This part helps you learn JavaScript quickly and properly. JavaScript in depth: Learn details of ECMAScript 5, from syntax, variables, functions, and object-oriented programming to regular expressions and JSON with lots of examples. Pick a topic and jump in. Background: Understand JavaScript’s history and its relationship with other programming languages. Tips, tools, and libraries: Survey existing style guides, best practices, advanced techniques, module systems, package managers, build tools, and learning resources.","selfLink":"http://play.google.com/books/reader?id=qU3rAgAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=qU3rAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript: The Definitive Guide","authors":"David Flanagan","description":"This Fifth Edition is completely revised and expanded to cover JavaScript as it is used in today's Web 2.0 applications. This book is both an example-driven programmer's guide and a keep-on-your-desk reference, with new chapters that explain everything you need to know to get the most out of JavaScript, including: Scripted HTTP and Ajax XML processing Client-side graphics using the canvas tag Namespaces in JavaScript--essential when writing complex programs Classes, closures, persistence, Flash, and JavaScript embedded in Java applications Part I explains the core JavaScript language in detail. If you are new to JavaScript, it will teach you the language. If you are already a JavaScript programmer, Part I will sharpen your skills and deepen your understanding of the language. Part II explains the scripting environment provided by web browsers, with a focus on DOM scripting with unobtrusive JavaScript. The broad and deep coverage of client-side JavaScript is illustrated with many sophisticated examples that demonstrate how to: Generate a table of contents for an HTML document Display DHTML animations Automate form validation Draw dynamic pie charts Make HTML elements draggable Define keyboard shortcuts for web applications Create Ajax-enabled tool tips Use XPath and XSLT on XML documents loaded with Ajax And much more Part III is a complete reference for core JavaScript. It documents every class, object, constructor, method, function, property, and constant defined by JavaScript 1.5 and ECMAScript Version 3. Part IV is a reference for client-side JavaScript, covering legacy web browser APIs, the standard Level 2 DOM API, and emerging standards such as the XMLHttpRequest object and the canvas tag. More than 300,000 JavaScript programmers around the world have madethis their indispensable reference book for building JavaScript applications. \"A must-have reference for expert JavaScript programmers...well-organized and detailed.\" -- Brendan Eich, creator of JavaScript","selfLink":"http://play.google.com/books/reader?id=2weL0iAfrEMC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=2weL0iAfrEMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"You Don't Know JS: Scope & Closures","authors":"Kyle Simpson","description":"No matter how much experience you have with JavaScript, odds are you don’t fully understand the language. This concise yet in-depth guide takes you inside scope and closures, two core concepts you need to know to become a more efficient and effective JavaScript programmer. You’ll learn how and why they work, and how an understanding of closures can be a powerful part of your development skillset. Like other books in the \"You Don’t Know JS\" series, Scope and Closures dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge, you can achieve true JavaScript mastery. Learn about scope, a set of rules to help JavaScript engines locate variables in your code Go deeper into nested scope, a series of containers for variables and functions Explore function- and block-based scope, “hoisting”, and the patterns and benefits of scope-based hiding Discover how to use closures for synchronous and asynchronous tasks, including the creation of JavaScript libraries","selfLink":"http://play.google.com/books/reader?id=IS0EAwAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=IS0EAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Eloquent JavaScript","authors":"Marijn Haverbeke","description":"JavaScript is at the heart of almost every modern Web application, whether it's Google Apps, Twitter, or the newest browser-based game. Though it's simple for beginners to pick up and play with, JavaScript is not a toy—it's a flexible and complex language that can be used to build full-scale applications. Eloquent JavaScript dives into this flourishing language and teaches you to write code that's beautiful and effective. By immersing you in example code and encouraging experimentation right from the start, the author quickly gives you the tools you need to build your own programs. As you follow along with examples like an artificial life simulation and a version of the classic game Sokoban, you'll learn to: –Understand the essential elements of programming: syntax, control, and data –Use object-oriented and functional programming techniques to organize and clarify your programs –Script the browser and make basic Web applications –Work with tools like regular expressions and XMLHttpRequest objects And since programming is an art that's best learned by doing, all example code is available online in an interactive sandbox for you to experiment with. With Eloquent JavaScript as your guide, you can tweak, expand, and modify the author's code, or throw it away and build your own creations from scratch. Before you know it, you'll be fluent in the language of the Web.","selfLink":"http://play.google.com/books/reader?id=UAYvDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=UAYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Scripting InDesign with JavaScript","authors":"Peter Kahrel","description":"This Short Cut covers only InDesign CS2. For coverage of InDesign CS3 and CS4, see the version at http://oreilly.com/catalog/9780596802523​/. InDesign provides a powerful set of tools for producing beautiful documents. While you can certainly do all your work by hand through InDesign's graphical interface, there are many times when it's much easier to write a script. Once you've automated a task, you can run it over the whole document, ensuring consistency, or just when you need it, simplifying and speeding your layout process. All it takes is a bit of JavaScript knowledge and a willingness to explore InDesign's programming features. (This version covers only InDesign CS2. For coverage of InDesign CS3 and CS4, see the version at http://oreilly.com/catalog/9780596802523​/.)","selfLink":"http://play.google.com/books/reader?id=OW_6BWEQAo4C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=OW_6BWEQAo4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript","authors":"David Flanagan","description":"A guide for experienced programmers demonstrates the core JavaScript language, offers examples of common tasks, and contains an extensive reference to JavaScript commands, objects, methods, and properties.","selfLink":"http://play.google.com/books/reader?id=vJGlu9t9LNYC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=vJGlu9t9LNYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript: The Missing Manual","authors":"David Sawyer McFarland","description":"JavaScript is an essential language for creating modern, interactive websites, but its complex rules challenge even the most experienced web designers. With JavaScript: The Missing Manual, you'll quickly learn how to use JavaScript in sophisticated ways -- without pain or frustration -- even if you have little or no programming experience. JavaScript expert David McFarland first teaches you the basics by having you build a simple program. Then you'll learn how to work with jQuery, a popular library of pre-built JavaScript components that's free and easy to use. With jQuery, you can quickly build modern, interactive web pages -- without having to script everything from scratch! Learn how to add scripts to a web page, store and manipulate information, communicate with the browser window, respond to events like mouse clicks and form submissions, and identify and modify HTML Get real-world examples of JavaScript in action Learn to build pop-up navigation bars, enhance HTML tables, create an interactive photo gallery, and make web forms more usable Create interesting user interfaces with tabbed panels, accordion panels, and pop-up dialog boxes Learn to avoid the ten most common errors new programmers make, and how to find and fix bugs Use JavaScript with Ajax to communicate with a server so that your web pages can receive information without having to reload","selfLink":"http://play.google.com/books/reader?id=CxY3lNQTATQC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=CxY3lNQTATQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Pro JavaScript Design Patterns","authors":"Dustin Diaz, Ross Harmes","description":"With Pro JavaScript Design Patterns, you’ll start with the basics of object-oriented programming in JavaScript applicable to design patterns, including making JavaScript more expressive, inheritance, encapsulation, information hiding, and more. The book then details how to implement and take advantage of several design patterns in JavaScript. Each chapter is packed with real-world examples of how the design patterns are best used and expert advice on writing better code, as well as what to watch out for. Along the way you’ll discover how to create your own libraries and APIs for even more efficient coding.","selfLink":"http://play.google.com/books/reader?id=za3vlnlWxb0C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=za3vlnlWxb0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Advanced Javascript","authors":"Chuck Easttom","description":"Advanced JavaScript, Third Edition provides an in-depth examination of the most important features of JavaScript. Beginning with an overview of JavaScript, the book quickly moves into more advanced features needed for complex yet robust JavaScript scripts, such as objects, arrays, and date and time functions. Additionally, various features of JavaScript that are essential for modern web pages are discussed, including manipulating the status bar, creating dynamic calendars, and working with forms, images, and the Document Object Model. Numerous examples illustrate how to implement various techniques. Topics covered how to enhance your web pages with LED signs, banners, and images; implementing cookies to store and retrieve information; the structure of the Document Object Model and how it can be used to view, access, and change an HTML document; Security measures to protect private information while using the Internet.","selfLink":"http://play.google.com/books/reader?id=BCtt4oHdbyIC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=BCtt4oHdbyIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript For Dummies","authors":"Emily A. Vander Veer","description":"Responding to reader feedback, the author has thoroughly revamped the book with more step-by-step coverage of JavaScript basics, an exclusive focus on Internet Explorer, and many complete sample scripts Updated to cover JavaScript 1.5, the latest release of this popular Web scripting language Using lots of examples, including a sample working Web site, the book shows how to create dynamic and interactive pages, build entire sites, and automate pages","selfLink":"http://play.google.com/books/reader?id=DiK_UShlVCEC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=DiK_UShlVCEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Practical JavaScript, DOM Scripting and Ajax Projects","authors":"Frank Zammetti","description":"This \"learn by example\" book offers 10 complete JavaScript projects that will save web developers countless hours of development time. These projects can serve as samples to learn from and/or be adapted for use in other projects. The 10 projects all address common needs in modern web applications, including a utility library, a validation framework, a GUI widget framework, a dynamic event calendar application, a drag and drop shopping cart, and more! Coverage details JavaScript best practices, Ajax techniques, and some of the most popular JavaScript libraries, such as Prototype, Script.aculo.us, and the Yahoo YUI library.","selfLink":"http://play.google.com/books/reader?id=oo26Kw9c2W4C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=oo26Kw9c2W4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Building iPhone Apps with HTML, CSS, and JavaScript","authors":"Jonathan Stark","description":"What people are saying about Building iPhone Apps w/ HTML, CSS, and JavaScript \"The future of mobile development is clearly web technologies like CSS, HTML and JavaScript. Jonathan Stark shows you how to leverage your existing web development skills to build native iPhone applications using these technologies.\" --John Allsopp, author and founder of Web Directions \"Jonathan's book is the most comprehensive documentation available for developing web applications for mobile Safari. Not just great tech coverage, this book is an easy read of purely fascinating mobile tidbits in a fun colloquial style. Must have for all PhoneGap developers.\" -- Brian LeRoux, Nitobi Software It's a fact: if you know HTML, CSS, and JavaScript, you already have the tools you need to develop your own iPhone apps. With this book, you'll learn how to use these open source web technologies to design and build apps for the iPhone and iPod Touch on the platform of your choice-without using Objective-C or Cocoa. Device-agnostic mobile apps are the wave of the future, and this book shows you how to create one product for several platforms. You'll find guidelines for converting your product into a native iPhone app using the free PhoneGap framework. And you'll learn why releasing your product as a web app first helps you find, fix, and test bugs much faster than if you went straight to the App Store with a product built with Apple's tools. Build iPhone apps with tools you already know how to use Learn how to make an existing website look and behave like an iPhone app Add native-looking animations to your web app using jQTouch Take advantage of client-side data storage with apps that run even when the iPhone is offline Hook into advanced iPhone features -- including the accelerometer, geolocation, and vibration -- with JavaScript Submit your applications to the App Store with Xcode This book received valuable community input through O'Reilly's Open Feedback Publishing System (OFPS).","selfLink":"http://play.google.com/books/reader?id=3NQhBTNKJB8C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=3NQhBTNKJB8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript by Example","authors":"Ellie Quigley","description":"This is the definitive JavaScript tutorial for the serious nonprogrammer who is interested in mastering the full power of the language. Includes hundreds of example JavaScript programs that demonstrate both the fun and practical aspects.","selfLink":"http://play.google.com/books/reader?id=IAJv2N1n9JAC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=IAJv2N1n9JAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Professional JavaScript for Web Developers","authors":"Nicholas C. Zakas","description":"Dispels the myth that JavaScript is a \"baby\" language and demonstrates why it is the scripting language of choice used in the design of millions of Web pages and server–side applications Quickly covers JavaScript basics and then moves on to more advanced topics such as object–oriented programming, XML, Web services, and remote scripting Addresses the many issues that Web application developers face, including internationalization, security, privacy, optimization, intellectual property issues, and obfuscation Builds on the reader′s basic understanding of HTML, CSS, and the Web in general This book is also available as part of the 4–book JavaScript and Ajax Wrox Box (ISBN: 0470227818). This 4–book set includes: Professional JavaScript for Web Developers (ISBN: 0764579088) Professional Ajax 2nd edition (ISBN: 0470109491) Professional Web 2.0 Programming (ISBN: 0470087889) Professional Rich Internet Applications: Ajax and Beyond (ISBN: 0470082801)","selfLink":"http://play.google.com/books/reader?id=f_2R9ra2PjEC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=f_2R9ra2PjEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Learning JavaScript","authors":"Shelley Powers","description":"If you're new to JavaScript, or an experienced web developer looking to improve your skills, Learning JavaScript provides you with complete, no-nonsense coverage of this quirky yet essential language for web development. You'll learn everything from primitive data types to complex features, including JavaScript elements involved with Ajax and dynamic page effects. By the end of the book, you'll be able to work with even the most sophisticated libraries and web applications. Complete with best practices and examples of JavaScript use, this new edition shows you how to integrate the language with the browser environment, and how to practice proper coding techniques for standards-compliant websites. This book will help you: Learn the JavaScript application structure, including basic statements and control structures Identify JavaScript objects—String, Number, Boolean, Function, and more Use browser debugging tools and troubleshooting techniques Understand event handling, form events, and JavaScript applications with forms Develop with the Browser Object Model, the Document Object Model, and custom objects you create Learn about browser cookies and more modern client-side storage techniques Get details for using XML or JSON with Ajax applications Learning JavaScript follows proven learning principles to help you absorb the concepts at an easy pace, so you'll learn how to create powerful and responsive applications in any browser.","selfLink":"http://play.google.com/books/reader?id=3On-moJDuO0C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=3On-moJDuO0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript and Ajax for the Web","authors":"Tom Negrino, Dori Smith","description":"This task-based, visual reference guide has been fully revised. It uses step-by-step instructions and plenty of screenshots to give beginning and intermediate Web designers what they need to know to learn JavaScript. Readers can start from the beginning to get a tour of the programming language, or look up specific tasks to learn just what they need to know. In this updated seventh edition, readers will find new information on Ajax design and modern coding techniques.","selfLink":"http://play.google.com/books/reader?id=-2WsMNZ3g2sC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=-2WsMNZ3g2sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The Book of JavaScript, 2nd Edition","authors":"thau!","description":"Explains how to use the programming language to add interactivity and animation to Web sites, covering image swaps, functions, frames, cookies, alarms, frames, shopping carts, and Ajax.","selfLink":"http://play.google.com/books/reader?id=MrHaC5HAva8C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=MrHaC5HAva8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Special Edition Using JavaScript","authors":"Paul McFedries","description":"Special Edition Using JavaScript covers the following topics: An Overview of JavaScript Programming Fundamentals Basic Objects Working with Browser Windows Working with the Document Object Working with Forms Dynamic HTML","selfLink":"http://play.google.com/books/reader?id=vS6t524rE1sC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=vS6t524rE1sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript","authors":"Elizabeth Gandy, Simon Stobart","selfLink":"http://play.google.com/books/reader?id=9tGcgU4pRRUC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=9tGcgU4pRRUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Beginning JavaScript with DOM Scripting and Ajax","authors":"Christian Heilmann","description":"This is the most up-to-date book on JavaScript available, covering current standards, techniques, and practices. It provides all you need to know to hit the ground running, without making you trawl through hundreds of pages of syntax. The book contains multiple chapters on Ajax and DOM Scripting, which are two of the hottest web development and design tools available today. Using a pragmatic and thorough approach, the book ensures that even the most novice JavaScript programmers will become familiar and comfortable using the tools presented.","selfLink":"http://play.google.com/books/reader?id=M3Uqna8RIAkC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=M3Uqna8RIAkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Learn to Program with JavaScript","authors":"John Smiley","description":"Javascript is a powerful, object-based scripting language;JavaScript programs can be embedded directly in HTML web pages. When combined with the Document Object Model (DOM) defined by a web browser, Javascript allows you to create Dynamic HTML (DHTML) content and interactive client-side web applications. JavaScript syntax is similar to that of other popular programming languages such as C, C++ and Java, which makes it easy to learn for experienced programmers. At the same time, JavaScript is an interpreted scripting language, providing a flexible, forgiving environment in which new programmers can learn. There's no need to buy a JavaScript compiler or interpreter---the JavaScript interpreter is shipped as part of your Internet Browser.","selfLink":"http://play.google.com/books/reader?id=34rvZ4oeO28C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=34rvZ4oeO28C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Sams Teach Yourself JavaScript in 24 Hours","authors":"Michael Moncur","description":"JavaScript is one of the easiest, most straightforward ways to enhance a website with interactivity. Sams Teach Yourself JavaScript in 24 Hours, 4th Edition serves as an easy-to-understand tutorial on both scripting basics and JavaScript itself. The book is written in a clear and personable style with an extensive use of practical, complete examples. It also includes material on the latest developments in JavaScript and web scripting. You will learn how to use JavaScript to enhance web pages with interactive forms, objects, and cookies, as well as how to use JavaScript to work with games, animation, and multimedia.","selfLink":"http://play.google.com/books/reader?id=bKxhgNopylMC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=bKxhgNopylMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript Design","authors":"William B. Sanders","description":"Sanders covers JavaScript and its interaction with XML, ASP.NET, PHP, Perl, Flash, and Cold Fusion. Focuses on the issues of using JavaScript with Web pages; i.e. DOM, frames, forms, DHTML, etc. Has an easy-to-use example Glossary for quick lookup of JavaScript terms, statements, objects, methods, event handlers, and commands--each accompanied by an example.","selfLink":"http://play.google.com/books/reader?id=zVY9TKaVX0IC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=zVY9TKaVX0IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Beginning HTML, XHTML, CSS, and JavaScript","authors":"Jon Duckett","description":"An indispensable introductory guide to creating web pages using the most up-to-date standards This beginner guide shows you how to use XHTML, CSS, and JavaScript to create compelling Web sites. While learning these technologies, you will discover coding practices such as writing code that works on multiple browsers including mobile devices, how to use AJAX frameworks to add interactivity to your pages, and how to ensure your pages meet accessible requirements. Packed with real-world examples, the book not only teaches you how to write Web sites using XHTML, CSS and JavaScript, but it also teaches you design principles that help you create attractive web sites and practical advice on how to make web pages more usable. In addition, special checklists and appendices review key topics and provide helpful references that re-enforce the basics you've learned. Serves as an ideal beginners guide to writing web pages using XHTML Explains how to use CSS to make pages more appealing and add interactivity to pages using JavaScript and AJAX frameworks Share advice on design principles and how to make pages more attractive and offers practical help with usability and accessibility Features checklists and appendices that review key topics This introductory guide is essential reading for getting started with using XHTML, CSS and JavaScript to create exciting and compelling Web sites. Note: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.","selfLink":"http://play.google.com/books/reader?id=vOZLwYJHymQC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=vOZLwYJHymQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript Programmer's Reference","authors":"Alexei White","description":"Learn everything about utilizing the JavaScript language with the next generation of Rich Internet Applications from the accessible information in JavaScript Programmer’s Reference, both a tutorial and a reference guide for web developers. Master methods for using Java with applications like Microsoft’s Silverlight, Ajax, Flex, Flash and AIR by practicing with hands-on examples with practical, usable code. Employ this complete JavaScript reference to help you understand JavaScript Data Types, Variables, Operators, Expressions and Statements, work with JavaScript Frameworks and data, and improve performance with Ajax.","selfLink":"http://play.google.com/books/reader?id=XJrXl71TITIC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=XJrXl71TITIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript Application Cookbook","authors":"Jerry Bradenbaugh","description":"A valuable resource for Webmasters presents a number of readytogo JavaScript applications, along with thorough documentation, to help provide additional functionality to Web sites of all kinds. Original. (Beginning/Intermediate)","selfLink":"http://play.google.com/books/reader?id=17t801XaggoC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=17t801XaggoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript Programmer's Reference","authors":"Thomas Valentine, Jonathan Reid","description":"JavaScript Programmer's Reference is an invaluable resource that won't stray far from your desktop (or your tablet!). It contains detailed information on every JavaScript object and command, and combines that reference with practical examples showcasing how you can use those commands in the real world. Whether you're just checking the syntax of a method or you're starting out on the road to JavaScript mastery, the JavaScript Programmer's Reference will be an essential aid. With a detailed and informative tutorial section giving you the ins and outs of programming with JavaScript and the DOM followed by a command-by-command reference, your next project will pop with interactivity and keep your audience coming back for more. JavaScript Programmer's Reference is your one-stop source for everything you'll need to know to become a cutting edge web developer using the latest tools and techniques available today. In depth explanations and activities to explain not just the command in question, but why it is used in that way Progressive learning curve to not overwhelm and confuse you Handy and extremely informative quick-reference of every command within the JavaScript & DOM specifications","selfLink":"http://play.google.com/books/reader?id=_oeZs0woLv4C&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=_oeZs0woLv4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Beginning JavaScript","authors":"Paul Wilton, Jeremy McPeak","description":"The perennial bestseller returns with new details for using the latest tools and techniques available with JavaScript JavaScript is the definitive language for making the Web a dynamic, rich, interactive medium. This guide to JavaScript builds on the success of previous editions and introduces you to many new advances in JavaScript development. The reorganization of the chapters helps streamline your learning process while new examples provide you with updated JavaScript programming techniques. You'll get all-new coverage of Ajax for remote scripting, JavaScript frameworks, JavaScript and XML, and the latest features in modern Web browsers. Plus, all the featured code has been updated to ensure compliance with the most recent popular Web browsers. Introduces you to the latest capabilities of JavaScript, the definitive language for developing dynamic, rich, interactive Web sites Features new coverage of data types and variables, JavaScript and XML, Ajax for remote scripting, and popular JavaScript frameworks Offers updated code that ensures compliance with the most popular Web browsers Includes improved examples on the most up-to-date JavaScript programming techniques Continuing in the superlative tradition of the first three editions, Beginning JavaScript, Fourth Edition, gets you up to speed on all the new advances in JavaScript development.","selfLink":"http://play.google.com/books/reader?id=6V02XDYdyMIC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=6V02XDYdyMIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"HTML, CSS and JavaScript All in One, Sams Teach Yourself","authors":"Julie C. Meloni","description":"In just a short time, you can learn how to use HTML5, Cascading Style Sheets (CSS3), and JavaScript together to design, create, and maintain world-class websites. Using a straightforward, step-by-step approach, each lesson in this book builds on the previous ones, enabling you to learn the essentials from the ground up. Clear instructions and practical, hands-on examples show you how to use HTML to create the framework of your website, design your site's layout and typography with CSS, and then add interactivity with JavaScript and jQuery. Step-by-step instructions carefully walk you through the most common web development tasks Practical, hands-on examples show you how to apply what you learn Quizzes and exercises help you test your knowledge and stretch your skills Learn how to... Build your own web page and get it online in an instant Format text for maximum clarity and readability Create links to other pages and to other sites Add graphics, color, and visual pizzazz to your web pages Work with transparent images and background graphics Design your site’s layout and typography using CSS Get user input with web-based forms Use JavaScript to build dynamic, interactive web pages Add AJAX effects to your web pages Leverage JavaScript libraries such as jQuery Make your site easy to maintain and update as it grows Contents at a Glance Part I Getting Started on the Web 1 Understanding How the Web Works 2 Structuring an HTML Document 3 Understanding Cascading Style Sheets 4 Understanding JavaScript 5 Validating and Debugging Your Code Part II Building Blocks of Practical Web Design 6 Working with Fonts, Text Blocks, Lists, and Tables 7 Using External and Internal Links 8 Working with Colors, Images, and Multimedia Part III Advanced Web Page Design with CSS 9 Working with Margins, Padding, Alignment, and Floating 10 Understanding the CSS Box Model and Positioning 11 Using CSS to Do More with Lists, Text, and Navigation 12 Creating Fixed or Liquid Layouts Part IV Getting Started with Dynamic Sites 13 Understanding Dynamic Websites and HTML5 Applications 14 Getting Started with JavaScript Programming 15 Working with the Document Object Model (DOM) 16 Using JavaScript Variables, Strings, and Arrays 17 Using JavaScript Functions and Objects 18 Controlling Flow with Conditions and Loops 19 Responding to Events 20 Using Windows Part V Advanced JavaScript Programming 21 JavaScript Best Practices 22 Using Third-Party JavaScript Libraries and Frameworks 23 A Closer Look at jQuery 24 First Steps Toward Creating Rich Interactions with jQuery UI 25 AJAX: Remote Scripting Part VI Advanced Website Functionality and Management 26 Working with Web-Based Forms 27 Organizing and Managing a Website","selfLink":"http://play.google.com/books/reader?id=0U6nBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=0U6nBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"PHP, MySQL, JavaScript & HTML5 All-in-One For Dummies","authors":"Steve Suehring, Janet Valade","description":"Get the basics on four key web programming tools in one great book! PHP, JavaScript, and HTML5 are essential programming languages for creating dynamic websites that work with the MySQL database. PHP and MySQL provide a robust, easy-to-learn, open-source solution for creating superb e-commerce sites and content management. JavaScript and HTML5 add support for the most current multimedia effects. This one-stop guide gives you what you need to know about all four! Seven self-contained minibooks cover web technologies, HTML5 and CSS3, PHP programming, MySQL databases, JavaScript, PHP with templates, and web applications. Addresses how PHP, MySQL, JavaScript, and HTML5 are vital tools for creating dynamic, database-driven websites and are especially important for e-commerce sites Serves as essential reading for web designers who are new to these technologies, offering a crash course covering all of these powerful technologies in this handy volume of seven self-contained minibooks Covers how to program in PHP and how to create and administer a MySQL database as well as how to manipulate MySQL data via a web interface Shows how to create a secure website and how to code popular e-business applications such as login programs and shopping carts With seven books in one, PHP, MySQL, JavaScript & HTML5 All-in-One For Dummies will turn your website into the center of attention in no time at all.","selfLink":"http://play.google.com/books/reader?id=1cmF0twN4rIC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=1cmF0twN4rIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript Made Easy","authors":"Dr.Liew Voon Kiong","description":"JavaScript Made Easy covers the basics of JavaScript. It comprises many interesting sample scripts. The book was written in simple and plain English to help you master JavaScript easily . By reading this book, you should be able to use JavaScript in developing powerful and interactive websites.","selfLink":"http://play.google.com/books/reader?id=WubuBQAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=WubuBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"The HTML5 JavaScript Model","authors":"Matthew David","description":"JavaScript is the glue that enables HTML to become interactive. Learn how you can leverage JavaScript Libraries to quickly build beautiful Web applications. * Add Ajax libraries to your Web site * Use jQuery in your Web applications * Extend jQuery with a custom plugin * Take advantage of popular jQuery plugins * Workwith Adobe's Spry Framework * Use Yahoo's YUI framework The HTML5 JavaScript Model is the fourth of five articles on the new Web standard, HTML5. These five full-color articles feature ample visuals to illustrate what your Web sites can do with the help of HTML5. The articles are also combined in the book, HTML5, which will add exclusive material in the form of a related real-life project to go alongside each article. This article is equivalent to 39 print pages.","selfLink":"http://play.google.com/books/reader?id=UEP7o8T25PsC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=UEP7o8T25PsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"JavaScript Projects for Kids","authors":"Syed Omar Faruk Towaha","description":"Gear up for a roller-coaster ride into the world of JavaScript and programming with this easy-to-follow, fun, and entertaining project-based guide About This Book Get to know the concepts of HTML and CSS to work with JavaScript Explore the concepts of object-oriented programming Follow this step-by-step guide on the fundamentals of JavaScript programming Who This Book Is For If you've never written code before or you are completely new to the world of web programming, then this book is the right choice for you. This book is for kids of age 10 years and above and parents who are completely new to the world of programming and want to get introduced to programming. What You Will Learn Learn how to work with Google Developer tools to iterate, debug and profile your code Develop a Battleship game using the basic concepts of HTML and CSS Get to know the fundamentals of JavaScript programming Create our own version of Pac Man game. Discover the vital concepts of object-oriented programming In Detail JavaScript is the most widely-used programming language for web development and that's not all! It has evolved over the years and is now being implemented in an array of environments from websites to robotics. Learning JavaScript will help you see the broader picture of web development. This book will take your imagination to new heights by teaching you how to work with JavaScript from scratch. It will introduce you to HTML and CSS to enhance the appearance of your applications. You'll then use your skills to build on a cool Battleship game! From there, the book will introduce you to jQuery and show you how you can manipulate the DOM. You'll get to play with some cool stuff using Canvas and will learn how to make use of Canvas to build a game on the lines of Pacman, only a whole lot cooler! Finally, it will show you a few tricks with OOP to make your code clean and will end with a few road maps on areas you can explore further. Style and approach This is an easy-to-follow, informative, and fun guide that takes a project-based approach to teaching programming in JavaScript. You will learn everything you need to get started with serious web application development.","selfLink":"http://play.google.com/books/reader?id=nl0dDAAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=nl0dDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Learning PHP, MySQL, JavaScript, and CSS","authors":"Robin Nixon","description":"Learn how to build interactive, data-driven websites—even if you don’t have any previous programming experience. If you know how to build static sites with HTML, this popular guide will help you tackle dynamic web programming. You’ll get a thorough grounding in today’s core open source technologies: PHP, MySQL, JavaScript, and CSS. Explore each technology separately, learn how to combine them, and pick up valuable web programming concepts along the way, including objects, XHTML, cookies, and session management. This book provides review questions in each chapter to help you apply what you’ve learned. Learn PHP essentials and the basics of object-oriented programming Master MySQL, from database structure to complex queries Create web pages with PHP and MySQL by integrating forms and other HTML features Learn JavaScript fundamentals, from functions and event handling to accessing the Document Object Model Pick up CSS basics for formatting and styling your web pages Turn your website into a highly dynamic environment with Ajax calls Upload and manipulate files and images, validate user input, and secure your applications Explore a working example that brings all of the ingredients together","selfLink":"http://play.google.com/books/reader?id=gNiEADgNuFwC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=gNiEADgNuFwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Learning PHP, MySQL & JavaScript","authors":"Robin Nixon","description":"Build interactive, data-driven websites with the potent combination of open source technologies and web standards, even if you have only basic HTML knowledge. In this update to this popular hands-on guide, you’ll tackle dynamic web programming with the latest versions of today’s core technologies: PHP, MySQL, JavaScript, CSS, HTML5, and key jQuery libraries. Web designers will learn how to use these technologies together and pick up valuable web programming practices along the way—including how to optimize websites for mobile devices. At the end of the book, you’ll put everything together to build a fully functional social networking site suitable for both desktop and mobile browsers. Explore MySQL, from database structure to complex queries Use the MySQLi extension, PHP’s improved MySQL interface Create dynamic PHP web pages that tailor themselves to the user Manage cookies and sessions and maintain a high level of security Enhance the JavaScript language with jQuery and jQuery mobile libraries Use Ajax calls for background browser-server communication Style your web pages by acquiring CSS2 and CSS3 skills Implement HTML5 features, including geolocation, audio, video, and the canvas element Reformat your websites into mobile web apps","selfLink":"http://play.google.com/books/reader?id=vlZaDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=vlZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Maintainable JavaScript","authors":"Nicholas C. Zakas","description":"You may have definite ideas about writing code when working alone, but team development requires that everyone use the same approach. With the JavaScript practices in this book—including code style, programming tips, and automation—you will learn how to write maintainable code that other team members can easily understand, adapt, and extend. Author Nicholas Zakas assembled this collection of best practices as a front-end tech leader at Yahoo!, after completing his own journey from solo hacker to team player. He also includes rules recommended by other industry authorities. Use these tips and techniques to help your team set aside individual preferences and function at a higher level. Establish specific code conventions for your team Use tools such as JSLint and JSHint to keep your team on track Adopt style guidelines, such as basic formatting, to help your team produce uniform code Apply several programming practices to solve problems and improve code quality Create an automated JavaScript build system using a variety of utilities Integrate browser-based JavaScript testing with tools such as the YUI Test Selenium Driver","selfLink":"http://play.google.com/books/reader?id=bHhlCrvbqSoC&hl=&printsec=frontcover&source=gbs_api","imageLink":"http://books.google.com/books/content?id=bHhlCrvbqSoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}]